notebook/app/controllers/contacts_controller.rb

  def index
    @contacts = Contact.order(:nome).page(params[:page])
---
SELECT  "contacts".* FROM "contacts"  ORDER BY "contacts"."nome" ASC LIMIT 25 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "contacts" LIMIT 25 OFFSET 0) subquery_for_count

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("nome", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "aaaaaaaaaaaaaaa"], ["email", "hue"], ["kind_id", 2], ["rmk", ""], ["created_at", "2017-08-03 15:16:18.939952"], ["updated_at", "2017-08-03 15:16:18.939952"]]

    def set_kind_select
      @kind_select_all = Kind.order(:description)
---
SELECT "kinds".* FROM "kinds"  ORDER BY "kinds"."description" ASC