notebook/app/controllers/kinds_controller.rb

SELECT  "kinds".* FROM "kinds"  ORDER BY "kinds"."description" ASC LIMIT 25 OFFSET 0
---
  def index
    @kinds = Kind.order(:description).page(params[:page])

INSERT INTO "kinds" ("description", "created_at", "updated_at") VALUES (?, ?, ?)  [["description", "teste"], ["created_at", "2017-08-03 15:45:27.309494"], ["updated_at", "2017-08-03 15:45:27.309494"]]
---
  def create
    @kind = Kind.new(kind_params)

    respond_to do |format|
      if @kind.save

DELETE FROM "kinds" WHERE "kinds"."id" = ?  [["id", 4]]
---
  def destroy
    @kind.destroy