notebook/app/controllers/phones_controller.rb

  def index
    @phones = Phone.order(:contact_id).page(params[:page])
---
SELECT  "phones".* FROM "phones"  ORDER BY "phones"."contact_id" ASC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "phones"